# encoding: utf-8
# language: ru

Функционал: Расчет возраста человека в месяцах
	Как кадровик
	Хочу рассчитывать возраст человека в месяцах
	Чтобы использовать результат для быстрого расчета премий 

Сценарий: Расчет возраста человека лет 0  
	Допустим у меня есть возраст человека в годах 0
	Тогда возраст человека в месяцах 0 
	
Сценарий: Расчет возраста человека лет 1  
	Допустим у меня есть возраст человека в годах 1 
	Тогда возраст человека в месяцах 12 

Сценарий: Расчет возраста человека лет 3  
	Допустим у меня есть возраст человека в годах 3 
	Тогда возраст человека в месяцах 36 


Сценарий: Расчет возраста человека лет 23  
	Допустим у меня есть возраст человека в годах 23 
	Тогда возраст человека в месяцах 276 
